//Showtime (รอบฉาย 1 รอบ)
//หน้าที่เก็บข้อมูลว่ารอบนี้ฉายหนังอะไร โรงไหน วันไหน กี่โมง และตอบคำถามง่ายๆ เกี่ยวกับรอบของตัวเองได้ เช่น จบกี่โมง หรือเริ่มไปแล้วหรือยัง


/*
field	ตัวอย่าง	ใช้ทำอะไร
movie	Movie       ของหนัง A	รู้ว่าฉายเรื่องอะไร (ได้ชื่อ ความยาว โปสเตอร์ไปด้วย)
hall	1	        โรงที่ฉาย
date	2026-09-26	วันที่ฉาย
start	10:00	    เวลาเริ่ม
 */

/*
method	                  ได้อะไร	                             ใครใช้
id()	             2026-09-26_H1_1000	                การจองอ้างถึงรอบนี้ด้วย id นี้ใน bookings.csv
end()	             12:10 (เริ่ม + ความยาวหนัง)	            เช็กตารางทับกัน และแสดงเวลาจบ
hasStarted(เวลาตอนนี้)	  true / false	                  หน้าจอใช้ทำปุ่มรอบเป็นสีเทา / ห้ามจอง

 */

package model;

public class Showtime {
    
}
